package Ch09;

public class C00ClassInfo
{

	public static void main(String[] args)
	{
		// 객체 : 존재(공간을 차지하는..) 사물
		// 자바의 객체(인스턴스)
		// 현실 객체에 대한 정보(속성/기능)의 일부를 메모리공간에 담아 놓은 상태

		// 객체 지향
		// 홍길동
		// 이름,나이,주소,성별,몸무게,신장,머리카락유무,학력,경력,재력,...
		// 걷는다,뛴다,말한다,먹는다,소화한다...

		// 클래스
		// 객체를 생성하기 위해 미리 선언된 자료형
		// 클래스 자체로는 공간을 차지하지 않는다

		// Scanner sc = new Scanner(System.in)
		// new : Heap공간에 객체 생성(Heap : 객체전용 저장공간)
		// Scanner() : 생성자메소드(기능)를 통한 초기값 설정
		// Scanner sc : Scanner 클래스 자료형으로 sc라는 잠조변수 생성

		// JAVA 메모리 영역
		// 클래스 영역 : 공유메모리(static변수, static메소드, 생성자 메소드)
		// 스택 영역: 일반변수, 참조변수
		// 힙 영역: 객체
	}

}
